app/views/doctors/registrations/edit.html.erb

      <%= f.label :Especialidad %>
      <%= f.select :speciality_id, options_from_collection_for_select(Speciality.all, :id,:name, {:selected => resource.speciality_id})%>
---
SELECT "specialities".* FROM "specialities"