app/views/doctors/registrations/new.html.erb

SELECT "specialities".* FROM "specialities"
---
      <%= f.label :Especialidad %>
      <%= f.select :speciality_id, options_from_collection_for_select(Speciality.all, :id,:name) %>