app/controllers/profile_controller.rb

    def show
        begin
            @user=Doctor.find_by_username(params[:id])
            if @user == nil
                @user=Patient.find_by_username(params[:id])
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."username" = $1 LIMIT $2  [["username", "maryeliz96"], ["LIMIT", 1]]
SELECT  "patients".* FROM "patients" WHERE "patients"."username" = $1 LIMIT $2  [["username", "maryeliz96"], ["LIMIT", 1]]