app/views/profile/show.html.erb

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."username" = $1 LIMIT $2  [["username", "maryeliz96"], ["LIMIT", 1]]
---
<h1><%= @user.name%> <%= @user.lastname%></h1>
<% if Doctor.find_by_username(params[:id]) %>

SELECT  "specialities".* FROM "specialities" WHERE "specialities"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
<h1>Especialidad</h1>
<h3><%= Speciality.find(@user.speciality_id).name%></h3>

SELECT  "patients".* FROM "patients" WHERE "patients"."username" = $1 LIMIT $2  [["username", "maryeliz96"], ["LIMIT", 1]]
---
<%end%>
<% if Patient.find_by_username(params[:id]) %>